# Pandas tutorial DAY 11
This notebook explains.......

### Install Libraries

In [8]:
# pip install pandas 
#pip install numpy

### Import Libraries

In [9]:
import pandas as pd
import numpy as np

### Object Creation

In [10]:
s=pd.Series([1,3,5,7,8,9])
s

0    1
1    3
2    5
3    7
4    8
5    9
dtype: int64

In [11]:
s=pd.Series([1,3,np.nan,5,7,8,9])
s

0    1.0
1    3.0
2    NaN
3    5.0
4    7.0
5    8.0
6    9.0
dtype: float64

In [12]:
import pandas as pd
dates = pd.date_range("20220101", periods=6)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
'''import pandas as pd
import numpy as np
dates = pd.date_range ("20220101", periods=6)
lists = pd.interval_range ("ABCD",  periods=4)'''
df= pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2022-01-01  1.232670 -2.089802 -1.167969 -1.149890
2022-01-02 -0.774637 -0.940392  0.189760 -0.628203
2022-01-03 -0.687258 -0.029863 -0.390412  0.932509
2022-01-04  1.130900 -0.312632 -0.839163 -0.751151
2022-01-05 -0.342912  0.037172  1.219091  0.032538
2022-01-06 -1.434726  0.246288 -0.013008 -1.247982

In [14]:
df= pd.DataFrame(
    {
        "A": "1.0",
        "B": pd.Timestamp ("20130102"),
        "C": pd.Series(1, index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test","train","test","train"]),
        "F": "foo",
        "G": "female"
    }
)
df

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female

In [15]:
df1= pd.DataFrame(
    {
        "A": "1.0",
        "B": pd.Timestamp ("20130111"),
        "C": pd.Series(1, index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["girl","woman","girl","woman"]),
        "F": "foo",
        "G": "female"
    }
)
df1

     A          B    C  D      E    F       G
0  1.0 2013-01-11  1.0  3   girl  foo  female
1  1.0 2013-01-11  1.0  3  woman  foo  female
2  1.0 2013-01-11  1.0  3   girl  foo  female
3  1.0 2013-01-11  1.0  3  woman  foo  female

In [16]:
df1.dtypes

A            object
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

In [17]:
df.head()

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female

In [18]:
df.tail()

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female

In [19]:
df.head(2)

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female

In [20]:
df.tail(1)

     A          B    C  D      E    F       G
3  1.0 2013-01-02  1.0  3  train  foo  female

In [21]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [22]:
df1.to_numpy()

array([['1.0', Timestamp('2013-01-11 00:00:00'), 1.0, 3, 'girl', 'foo',
        'female'],
       ['1.0', Timestamp('2013-01-11 00:00:00'), 1.0, 3, 'woman', 'foo',
        'female'],
       ['1.0', Timestamp('2013-01-11 00:00:00'), 1.0, 3, 'girl', 'foo',
        'female'],
       ['1.0', Timestamp('2013-01-11 00:00:00'), 1.0, 3, 'woman', 'foo',
        'female']], dtype=object)

In [23]:
df.describe

<bound method NDFrame.describe of      A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female>

In [24]:
df1.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-11 00:00:00,2013-01-11 00:00:00,2013-01-11 00:00:00,2013-01-11 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,girl,woman,girl,woman
F,foo,foo,foo,foo
G,female,female,female,female

In [25]:
df.sort_index(axis=0,ascending=False)

     A          B    C  D      E    F       G
3  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
0  1.0 2013-01-02  1.0  3   test  foo  female

In [26]:
df.sort_index(axis=1,ascending=False)

        G    F      E  D    C          B    A
0  female  foo   test  3  1.0 2013-01-02  1.0
1  female  foo  train  3  1.0 2013-01-02  1.0
2  female  foo   test  3  1.0 2013-01-02  1.0
3  female  foo  train  3  1.0 2013-01-02  1.0

In [27]:
df.sort_index(axis=1,ascending=True)

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female
2  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female

In [28]:
df1.sort_values(by="B", ascending=True)

     A          B    C  D      E    F       G
0  1.0 2013-01-11  1.0  3   girl  foo  female
1  1.0 2013-01-11  1.0  3  woman  foo  female
2  1.0 2013-01-11  1.0  3   girl  foo  female
3  1.0 2013-01-11  1.0  3  woman  foo  female

In [29]:
df["A"]

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: object

In [30]:
df[0:2]

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
1  1.0 2013-01-02  1.0  3  train  foo  female

In [31]:
df1

     A          B    C  D      E    F       G
0  1.0 2013-01-11  1.0  3   girl  foo  female
1  1.0 2013-01-11  1.0  3  woman  foo  female
2  1.0 2013-01-11  1.0  3   girl  foo  female
3  1.0 2013-01-11  1.0  3  woman  foo  female

In [32]:
df.loc[:,["A","B"]]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
2  1.0 2013-01-02
3  1.0 2013-01-02

In [39]:
df.loc[[1],:]

     A          B    C  D      E    F       G
1  1.0 2013-01-02  1.0  3  train  foo  female

In [41]:
df.loc[[0,3],:]

     A          B    C  D      E    F       G
0  1.0 2013-01-02  1.0  3   test  foo  female
3  1.0 2013-01-02  1.0  3  train  foo  female

In [42]:
df.loc[[0,1],["A","B"]]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02